<template><h2 id="《阿里感悟》如何在三年内成长为一名技术专家" tabindex="-1"><a class="header-anchor" href="#《阿里感悟》如何在三年内成长为一名技术专家" aria-hidden="true">#</a> 《阿里感悟》如何在三年内成长为一名技术专家</h2>
<p>工作前三年是职业生涯中成长最快的几年，在这段时间里你会充满激情，做事专注，也容易养成良好的习惯。</p>
<p>在我们公司有些同学在前三年中就快速成为某一个领域的技术专家，有些同学也可能止步不前。本文和大家一起探讨下如何在三年内快速成长为一名技术专家。
rapid-growth-as-a-technologist
学习方法</p>
<p>1：掌握良好的学习心态
2：掌握系统化的学习方法
3：知识如何内化成能力
4：广度和深度的选择</p>
<p>实战技巧</p>
<p>1：你需要学会的编码习惯
2：在业务团队做开发如何成长</p>
<p>掌握良好的学习心态</p>
<p>空杯心态</p>
<h2 id="二、拒绝寻求帮助" tabindex="-1"><a class="header-anchor" href="#二、拒绝寻求帮助" aria-hidden="true">#</a> 二、拒绝寻求帮助</h2>
<p>这一条在学习和工作场景中都很常见。我们很多人都不寻求帮助。原因很多，但我认为最主要的原因无非是自尊以及害怕让人认为自己啥也不会。我们很多人都有冒名顶替综合征，觉得自己不完全胜任自己的工作。我在公司里、在和客户打交道时、甚至在上课和辅导中都有这种感觉。我们认为寻求帮助会强化这种感觉。但事实上，它浪费了大量时间，阻碍了你的成长。</p>
<p>其他真正的开发人员们都是视频或书籍一般的资源，甚至要比这些好太多。他们可以直接回答你的问题，帮助你真正的理解它。</p>
<p>只有混蛋才会因为你问问题而批评你，这时候我会尽力避开这些人。</p>
<p>如果你想要自己找到答案，不想寻求帮助，那也没问题，给自己一个时间限制。当你的前辈就在你旁边，他可能知道或至少可以帮到你的时候，千万不要浪费几天时间来寻找答案。</p>
<h2 id="四、混乱的代码" tabindex="-1"><a class="header-anchor" href="#四、混乱的代码" aria-hidden="true">#</a> 四、混乱的代码</h2>
<p>这一条更多地是一种技术习惯，但也可能意味着很多事情。你应当以一种直观、高效、安全的方式写代码。这在自学的时候简直太难了，因为在相关的课程中，你学到的不是写某些代码的最佳方法，而是导师认为这么写最容易理解一些核心概念。所以，你必须进行一些额外的研究，找出清理你代码的最佳方法。</p>
<p>我绝对建议你使用“避免重复代码原则”（DRY principle，don’t repeat yourself）。如果你遇到常见的代码块，那就创建某种“类”（class）或“函数”（function）来合并这部分功能，而不是仅仅重复它。这让代码更加简洁，节省了大量代码行，并且便于他人使用。</p>
<p>你也要注意性能，比如压缩图片、缩小JavaScript和CSS。你可以使用task runner（如gulp）或其他工具自动完成压缩，面对小型任务，你甚至可以使用minifier.org等手动完成。</p>
<p>另外，不要进行不必要的API接口调用，要使你的全栈应用程序以尽可能少的请求完成你需要的全部功能。以及测试……我在这上面犯了很多错，没有做足够的测试。就我所知，单元测试有助于搭建更健全的应用程序，避免潜在问题，节约时间和开销。但我就是很讨厌它，这可能是我最坏的习惯之一，也是我成为更好的开发人员需要解决的大问题。有时候我们回了节约时间减少测试，但在现实中，这样做会降低应用程序的性能、效率和可读性，而且与一开始就采用正确的方法相比，它可能在将来引起更大的麻烦。所以请记住这一点。</p>
<h2 id="六、糟糕的办公室政治" tabindex="-1"><a class="header-anchor" href="#六、糟糕的办公室政治" aria-hidden="true">#</a> 六、糟糕的办公室政治</h2>
<p>这一条是给那些在公司工作的人们的。你和其他人一起工作，但这反过来又会引起冲突、分歧、争论等等。许多开发人员十分傲慢，总认为自己是正确的，即使他们知道自己犯了错，他们中的一些人也永远不会承认。我不是说这是大多数开发人员，但我认为我们至少会遇到一位这样的人。我听很多人说，他们的团队非常棒，成员之间相处得非常融洽，这很好，但不是所有团队都是这样子。</p>
<ul>
<li>很多时候你们会在想法和解决方案上发生冲突，试着表现得老练和对对方的尊重，但同时，也不要太容易就被说服，尤其是当你对自己的提案非常有信心的时候。</li>
<li>不要大喊大叫，不要骂人，千万别做这些事情，这什么用也没有。</li>
<li>如果他们开始这样对待你，你就离开，做一个更强大的人。</li>
<li>如果你不幸遇到了一个十足混蛋的团队成员，他完全不听理由，你除了想办法避开他之外，别无他法。</li>
<li>在某些情况下，你可能不得不和你们的领导交谈，不过我还是建议你先和那个人谈谈。</li>
</ul>
<h2 id="九、做一个无所不知的人" tabindex="-1"><a class="header-anchor" href="#九、做一个无所不知的人" aria-hidden="true">#</a> 九、做一个无所不知的人</h2>
<p>我之前提到过，我认为一些开发人员十分傲慢的原因是，他们认为自己无所不知。他们从不听其他人的意见，他们为啥要听呢？他们知道所有的答案。如果你周围全是这样的人，那真是糟透了，这对你也没好处，因为你也会认为自己无所不知，就会不积极学习、不改善自己。我敢打赌，总有一天你会被自己犯下的错误叫醒，这源于你不听取任何人的意见，也不自己进行调研。</p>
<p>这些人大多数都是 Stack Overflow 网站（一个IT技术问答网站）的魔鬼，他们取笑新开发人员的问题，嘲笑他人的回答，一有机会就点击“反对”。我讨厌死这些人了。我认为他们中的许多人在学校里就总是被人找茬，他们利用自己的知识欺负其他可能有问题或是没有所得的开发人员，看上去像是忘掉了被欺负的感受，只想要复仇。我这个理论可能有问题，只是一家之言。</p>
<p>无论他们出于什么原因这么做，我认为如果他们思想开放、欢迎不同的想法、尊重他人，那他们就会比总是想要“正确”的人快乐多了。他们可能是团队中最聪明的人，也是最糟糕的人，因为没人愿意和他们合作，无法进行良好的沟通。对于一个想要成功的团队来说，沟通和团结是必需的，而无所不知的人会破坏这些。所以，如果你是这样的人，试着别那么自负，开放一点，尊重一点，你会走得更远。</p>
</template>
