<template><p>hosts 文件是一个没有扩展名的系统文件，可以用记事本等工具打开，作用就是将一些常用的网址域名与其对应的IP地址建立一个关联“数据库”，当用户在浏览器中输入一个需要登录的网址时，系统会首先自动从Hosts文件中寻找对应的IP地址，一旦找到，系统会立即打开对应网页，如果没有找到，则系统会再将网址提交DNS域名解析服务器进行IP地址的解析。
Hosts文件配置的映射是静态的，如果网络上的计算机更改了需要及时更新IP地址，否则将不能访问。</p>
<p>加快域名解析,对于要经常访问的网站，可以通过在Hosts中配置域名和IP的映射关系，这样当输入域名计算机就能很快解析出IP，而不用请求网络上的DNS服务器
方便局域网用户,在很多单位的局域网中，会有服务器提供给用户使用。但由于局域网中一般很少架设DNS服务器，访问这些服务要输入难记的IP地址，对不少人来说相当麻烦。现在可以分别给这些服务器取个容易记住的名字，然后在Hosts中建立IP映射，这样以后访问的时候我们输入这个服务器的名字就行了
屏蔽网站,现在有很多网站不经过用户同意就将各种各样的插件安装到计算机中，有些说不定就是木马或病毒。对于这些网站可以利用Hosts把该网站的域名映射到错误的IP或自己计算机的IP，这样就不用访问了
顺利连接系统,对于Lotus的服务器和一些数据库服务器，在访问时如果直接输入IP地址那是不能访问的，只能输入服务器名才能访问。那么配置好Hosts文件，这样输入服务器名就能顺利连接了。
最后要指出的是，Hosts文件配置的映射是静态的，如果网络上的计算机更改了请及时更新IP地址，否则将不能访问
强制指定某域名对应某IP地址,新建的网站已经上传到服务器需要调试但是还不想外布访问，或者不想被蜘蛛抓取到时，可以修改本地hosts文件，这样只有自己的电脑能通过域名来访问网站</p>
<h2 id="hosts位置" tabindex="-1"><a class="header-anchor" href="#hosts位置" aria-hidden="true">#</a> hosts位置</h2>
<p>C:\windows\system32\drivers\etc</p>
<h2 id="添加hosts" tabindex="-1"><a class="header-anchor" href="#添加hosts" aria-hidden="true">#</a> 添加hosts</h2>
<p>按照 ip地址 域名 的格式添加单独的一行记录 182.61.171.72 www.axure.com , ip地址和域名之间，要有至少1个空格</p>
<h2 id="localhost和127-0-0-1" tabindex="-1"><a class="header-anchor" href="#localhost和127-0-0-1" aria-hidden="true">#</a> localhost和127.0.0.1</h2>
<p>localhost是一个域名，127.0.0.1为IP地址。Windows系统中，约定127.0.0.1为本地IP地址。localhost是其对应的域名。配置是在hosts文件中设置的，Windows下该文件位置为：C:\Windows\System32\drivers\etc目录下hosts文件</p>
<h2 id="http请求过程" tabindex="-1"><a class="header-anchor" href="#http请求过程" aria-hidden="true">#</a> HTTP请求过程</h2>
<ul>
<li>首先在浏览器中输入网址</li>
<li>浏览器根据域名解析IP地址</li>
<li>浏览器根据解析的IP地址与web服务器建立一个TCP连接</li>
<li>浏览器给服务器发送HTTP请求</li>
<li>服务器的永久重定向响应</li>
<li>浏览器跟踪重定向地址</li>
<li>服务器处理请求</li>
<li>服务器发回一个HTTP响应</li>
<li>释放TCP连接</li>
<li>客户端浏览器解析HTML内容
其中的第二步就和上面提到的hosts文件有很重要的联系。浏览器访问网站，要首先通过DNS服务器把要访问的网站域名解析成一个唯一的IP地址，之后，浏览器才能对此网站进行定位并且访问其数据。
在引入DNS（Domain Name System，域名系统）之前，网络中的主机是将容易记忆的域名映射到IP地址并将它保存在一个共享的静态文件hosts中，再由hosts文件来实现网络中域名的管理。最初Internet非常小，仅使用这个集中管理的文件就可以通过FTP为连入Internet的站点和主机提供域名的发布和下载。每个Internet站点将定期地更新其主机文件的副本，并且发布主机文件的更新版本来反映网络的变化。
但是，当Internet上的计算机迅速增加时，通过一个中心授权机构为所有Internet主机管理一个主机文件的工作将无法进行。文件会随着时间的推移而增大，这样按当前和更新的形式维持文件以及将文件分配至所有站点将变得非常困难，甚至无法完成，于是才有了DNS服务器。
操作系统规定，在进行DNS请求以前，先检查自己的Hosts文件中是否有这个域名和IP的映射关系。如果有，则直接访问这个IP地址指定的网络位置，如果没有，再向已知的DNS服务器提出域名解析请求。也就是说Hosts的IP解析优先级比DNS要高。</li>
</ul>
</template>
